#include <iostream>
#include <cmath>   // Для математичних функцій
using namespace std;

int main() {
    //Задача №1, варіант 20: З початку доби минуло N секунд (N - ціле). Знайти кількість повних годин, що минули з початку доби.
    double N;
    // Введення кількості секунд з початку доби
    cout << "Введіть кількість секунд з початку доби: ";
    cin >> N;
    // Обчислення кількості повних годин
    int hours = N / 3600;  // 1 година = 3600 секунд
    cout << "Кількість повних годин: " << hours << endl;
    //Задача №2, варіант 19: Дано три цілих числа: A, B, C. Перевірити істинність висловлювання: «Серед трьох даних цілих чисел є хоча б одна пара взаємно протилежних».
    double A, B, C;
    // Введення трьох цілих чисел
    cout << "Введіть три цілі числа: " << endl;
    cin >> A;
    cin >> B;
    cin >> C;
    // Перевірка на наявність пари взаємно протилежних чисел
    if ((A == -B) || (A == -C) || (B == -C)) {
        cout << "Існує пара взаємно протилежних чисел." << endl;
    } else {
        cout << "Немає пари взаємно протилежних чисел." << endl;
    }
    //Задача №3, варіант 12
    double x, y;
    // Введення значення змінної x
    cout << "Введіть значення x: ";
    cin >> x;
    // Обчислення "y" згідно з формулою
    double chus = tan(fabs(2 * pow(x, 2) + 5 * x - 31.15)) + log(fabs(x - 2.5)) / log(5);  // обчислення чисельника
    double znam = cbrt(fabs(pow(sin(pow(x, 3)), 2) + (1.0 / 3.0) * log(fabs(pow(x, 2) - 2.5)) / log(5))); // обчислення знаменника
    // Перевірка на можливість ділення на нуль
    if (chus != 0) {
        y = znam / chus; //обчислення у
        cout << "Значення y: " << y << endl;
    } else {
        cout << "Ділення на нуль неможливе." << endl;
    }
    return 0;
}